In [11]:
import pandas as pd
data1 = {"Emp Id":["E01","E02","E03","E04","E05","E06"],
        "Names":["Ram","Shyam","Rahul","Vishal","Rabi","John"],
        "Age":[34,56,23,44,32,36]}
data2 = {"Emp Id":["E01","E07","E03","E04","E08","E06"],
        "Salary":[45000,56000,34000,30000,50000,62000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp Id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Rabi   32
5    E06    John   36

  Emp Id  Salary
0    E01   45000
1    E07   56000
2    E03   34000
3    E04   30000
4    E08   50000
5    E06   62000

In [12]:
print(pd.merge(df1,df2,on = "Emp Id"))  # merge on the basis of Emp id

  Emp Id   Names  Age  Salary
0    E01     Ram   34   45000
1    E03   Rahul   23   34000
2    E04  Vishal   44   30000
3    E06    John   36   62000

In [14]:
print(pd.merge(left = df1, right = df2,how = "left"))  # how = "inner" --> by default common
# how = "left" --> will take everything of left side table

  Emp Id   Names  Age   Salary
0    E01     Ram   34  45000.0
1    E02   Shyam   56      NaN
2    E03   Rahul   23  34000.0
3    E04  Vishal   44  30000.0
4    E05    Rabi   32      NaN
5    E06    John   36  62000.0

In [16]:
print(pd.merge(left = df1, right = df2,how = "right"))  # how = "right" --> will take everything of right side table

  Emp Id   Names   Age  Salary
0    E01     Ram  34.0   45000
1    E07     NaN   NaN   56000
2    E03   Rahul  23.0   34000
3    E04  Vishal  44.0   30000
4    E08     NaN   NaN   50000
5    E06    John  36.0   62000

In [19]:
# concatenate
data1 = {"Emp Id":["E01","E02","E03","E04","E05","E06"],
        "Names":["Ram","Shyam","Rahul","Vishal","Rabi","John"],
        "Age":[34,56,23,44,32,36]}
data2 = {"Emp Id":["E07","E08","E09","E010","E011","E012"],
        "Names":["Sam","Kam","Sahul","Kushal","Rabi","Mohan"],
        "Age":[36,52,23,40,30,38]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [20]:
print(pd.concat([df1,df2]))

  Emp Id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Rabi   32
5    E06    John   36
0    E07     Sam   36
1    E08     Kam   52
2    E09   Sahul   23
3   E010  Kushal   40
4   E011    Rabi   30
5   E012   Mohan   38